// х размер ежемесячного платежа
// S сумма займа
// P 1/100 доля процентной ставки в месяц 
// N срок кредитования (в месяцах)

i доля процентов
s остаточный объем средств
P — упомянутая ранее процентная ставка.

i=s*P

12(%)/100/12(месяц)=0.01

х= 200000*(0.01+ 0.01/(((1+0.01)^24)-1))



let х = 431
let S = 1000
// P 1/100 доля процентной ставки в месяц 
let p = ?
let N = 5


x=S*(P+(P/(((1+P)^N)-1)))

S*(P+(P/(((1+P)^N)-1)))=431

//////////////////////////////////////////////////////////////////////////

//Сумма процентов по займу = Сумма займа * Процентная ставка / 365 (366) дней * Количество дней пользования займом;

//Сложные проценты ( иначе говоря капитализированные) рассчитываются путем умножения изначальной суммы займа на величину, равную ( 1+r)n,  где r – процентная ставка ( выраженная в долях), а n – количество прошедших платежных периодов.

summ * (percent-day/ Date.now(year)) * day

summ * 1+1